<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a5d33292e5ed370744b26905a465f89fe81d0b52a35a37a4d3213064ff00c158","plan_job_ref":"Job Environment Main - Plan #40 at https://github.com/jarrod-lowe/wildsea/actions/runs/10336782388","plan_out_hash":"18bcf8a966e01fdd9391bf538a6fa6c1610712c612038a1d1d6983ddd4293eaf","plan_hash":"948fdaa01aa6b604b48857146c50c109aed8bc9f0b2c52cf6f6f23d1253a853f","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
aws_account       = (sensitive value)
aws_region        = (sensitive value)
environment       = "primary"
saml_metadata_url = (sensitive value)
state_bucket      = "terraform-state-021891603679"
```
</details>
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_cognito_identity_pool.cognito will be created
+   resource "aws_cognito_identity_pool" "cognito" {
+       allow_classic_flow               = false
+       allow_unauthenticated_identities = false
+       arn                              = (known after apply)
+       id                               = (known after apply)
+       identity_pool_name               = "Wildsea-primary"
+       tags_all                         = {
+           "Application" = "Wildsea-primary"
        }

+       cognito_identity_providers {
+           client_id               = (known after apply)
+           provider_name           = (known after apply)
+           server_side_token_check = true
        }
    }

  # aws_cognito_identity_pool_roles_attachment.cognito will be created
+   resource "aws_cognito_identity_pool_roles_attachment" "cognito" {
+       id               = (known after apply)
+       identity_pool_id = (known after apply)
+       roles            = {
+           "authenticated" = "TODO"
        }
    }

  # aws_cognito_identity_provider.idp will be created
+   resource "aws_cognito_identity_provider" "idp" {
+       attribute_mapping = {
+           "email"          = "email"
+           "email_verified" = "emailVerified"
+           "family_name"    = "lastname"
+           "given_name"     = "firstname"
        }
+       id                = (known after apply)
+       provider_details  = {
+           "MetadataURL" = (sensitive value)
        }
+       provider_name     = "SAML"
+       provider_type     = "SAML"
+       user_pool_id      = (known after apply)
    }

  # aws_cognito_user_pool.cognito will be created
+   resource "aws_cognito_user_pool" "cognito" {
+       arn                        = (known after apply)
+       creation_date              = (known after apply)
+       custom_domain              = (known after apply)
+       deletion_protection        = "INACTIVE"
+       domain                     = (known after apply)
+       email_verification_message = (known after apply)
+       email_verification_subject = (known after apply)
+       endpoint                   = (known after apply)
+       estimated_number_of_users  = (known after apply)
+       id                         = (known after apply)
+       last_modified_date         = (known after apply)
+       mfa_configuration          = "OFF"
+       name                       = "Wildsea-primary"
+       sms_verification_message   = (known after apply)
+       tags_all                   = {
+           "Application" = "Wildsea-primary"
        }

+       admin_create_user_config {
+           allow_admin_create_user_only = true
        }

+       password_policy (known after apply)

+       sms_configuration (known after apply)

+       verification_message_template (known after apply)
    }

  # aws_cognito_user_pool_client.cognito will be created
+   resource "aws_cognito_user_pool_client" "cognito" {
+       access_token_validity                         = (known after apply)
+       allowed_oauth_flows                           = [
+           "code",
+           "implicit",
        ]
+       allowed_oauth_flows_user_pool_client          = true
+       allowed_oauth_scopes                          = [
+           "openid",
        ]
+       auth_session_validity                         = (known after apply)
+       callback_urls                                 = [
+           "TODO",
        ]
+       client_secret                                 = (sensitive value)
+       default_redirect_uri                          = (known after apply)
+       enable_propagate_additional_user_context_data = (known after apply)
+       enable_token_revocation                       = (known after apply)
+       explicit_auth_flows                           = [
+           "ALLOW_USER_PASSWORD_AUTH",
+           "ALLOW_USER_SRP_AUTH",
+           "USER_PASSWORD_AUTH",
        ]
+       generate_secret                               = true
+       id                                            = (known after apply)
+       id_token_validity                             = (known after apply)
+       logout_urls                                   = [
+           "TODO",
        ]
+       name                                          = "Wildsea-primary"
+       prevent_user_existence_errors                 = (known after apply)
+       read_attributes                               = (known after apply)
+       refresh_token_validity                        = (known after apply)
+       supported_identity_providers                  = [
+           "SAML",
        ]
+       user_pool_id                                  = (known after apply)
+       write_attributes                              = (known after apply)
    }

  # aws_cognito_user_pool_domain.cognito will be created
+   resource "aws_cognito_user_pool_domain" "cognito" {
+       aws_account_id                  = (known after apply)
+       cloudfront_distribution         = (known after apply)
+       cloudfront_distribution_arn     = (known after apply)
+       cloudfront_distribution_zone_id = (known after apply)
+       domain                          = "Wildsea-primary"
+       id                              = (known after apply)
+       s3_bucket                       = (known after apply)
+       user_pool_id                    = (known after apply)
+       version                         = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   identity_pool_id = (known after apply)
+   login_domain     = "Wildsea-primary.auth.ap-southeast-2.amazonaws.com"
+   user_pool_id     = (known after apply)
+   web_client_id    = (known after apply)
```
</details>

:memo: Plan generated in [Environment Main - Plan #40](https://github.com/jarrod-lowe/wildsea/actions/runs/10336782388)